GoalApp/app/controllers/goals_controller.rb

  def edit
    @goal = current_user.goals.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 4], ["LIMIT", 1]]

  def update
    @goal = current_user.goals.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 5], ["LIMIT", 1]]

  def destroy
    @goal = current_user.goals.find(params[:id])
    @goal.destroy
---
SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 4], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 4]]

  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save
---
INSERT INTO "goals" ("list_of_goal", "user_id") VALUES ($1, $2) RETURNING "id"  [["list_of_goal", "My goal is to graduate"], ["user_id", 7]]

  def not_users_page
    unless current_user.goal_ids.include?(params[:id].to_i)
---
SELECT "goals"."id" FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 7]]