GoalApp/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "parkg748"], ["password_digest", "$2a$10$u5GuobRwkBP44NYSsBV7c.ayEXF2DJUSduWL5dC8pmLzfjMJi6tQ6"], ["session_token", "BpbnKqU3XSWc_l_7ZfPZrA"]]
---
  def create
    @user = User.new(user_params)
    if @user.save